Repository: truongchanbuu/1-better-a-day
Catalog: lib/l10n/intl_*.arb
Languages: vi

# term_and_condition_statement
source: By signing in/signing up, you accept our Terms and Conditions and consent to our Privacy Policy
vi: Bằng cách đăng nhập/đăng ký, bạn chấp nhận Điều khoản và Điều kiện của chúng tôi và đồng ý với Chính sách Quyền riêng tư

# success_title
source: Success
vi: Thành công

# failure_title
source: Failure
vi: Thất bại

# warning_title
source: Warning
vi: Cảnh báo

# no_data_title
source: No Data
vi: Trống

# loading_title
source: Loading...
vi: Đang tải...

# searching_title
source: Searching...
vi: Tìm kiếm...

# send_button
source: Send
vi: Gửi

# accept_button
source: Accept
vi: Chấp nhận

# cancel_button
source: Cancel
vi: Hủy bỏ

# keep_button
source: Keep
vi: Giữ

# delete_button
source: Delete
vi: Xóa

# edit_button
source: Edit
vi: Chỉnh sửa

# find_button
source: Find
vi: Tìm kiếm

# active_button
source: Active
vi: Kích hoạt

# inactive_button
source: Inactive
vi: Không kích hoạt

# select_button
source: Select
vi: Chọn

# go_home_button
source: Go Home
vi: Về trang chủ

# save_button
source: Save
vi: Lưu

source: Start Date
vi: Ngày bắt đầu

source: End Date
vi: Ngày kết thúc

source: Show More
vi: Hiển thị

source: Show less
vi: Ẩn bớt

# less_title
source: Less
vi: Ít

# more_title
source: More
vi: Nhiều

# status_title
source: Status
vi: Trạng thái

# select_date_title
source: Select Date
vi: Chọn ngày

# select_range_date_title
source: Select Date Range
vi: Chọn ngày từ ... đến ...

# day_title
source: Day
vi: Ngày

# month_title
source: Month
vi: Tháng

# year_title
source: Year
vi: Năm

# total
source: Total: {count}
vi: Tổng số: {count}

# friend_title
source: friend
vi: anh bạn

# delete_title
source: Are you sure to delete this?
vi: Bạn có chắc muốn xóa không?

# delete_warning
source: This cannot be undone
vi: Hành động này sẽ không thể hoàn tác

# out_of_range
source: The number is out of range
vi: Số hiện tại đang vượt quá mức

source: Not Found
vi: Không tìm thấy

# logout_button
source: Log out
vi: Đăng xuất

# recovery_description
source: An reset-password mail will be sent to your email
vi: Một email đặt lại mật khẩu sẽ được gửi tới email của bạn

# re_auth_with_google
source: Re-authenticate with Google
vi: Xác thực với Google

# re_auth_with_email
source: Re-authenticate with Email
vi: Xác thực với Email

# login_failure_title
source: Login Failure
vi: Đăng nhập thất bại

# login_success_title
source: Login Success
vi: Đăng nhập thành công

# update_failure_title
source: Update Failure
vi: Cập nhật thất bại

# update_success_title
source: Update Success
vi: Cập nhật thành công

# verify_email_sent
source: A mail has been sent to your new email
vi: Một mail vừa được gửi vào email mới của bạn

# try_again
source: Please try again later
vi: Vui lòng thử lại sau

# empty_field
source: Please do not empty the field
vi: Vui lòng không để trống trường này

# invalid_form
source: Please check your information again
vi: Vui lòng kiểm tra lại thông tin của bạn

# invalid_password
source: Password must have at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

# invalid_email
source: Email is not valid or badly formatted.
vi: Email không hợp lệ hoặc được định dạng sai.

# invalid_phone
source: Phone number is not valid
vi: Số điện thoại không hợp lệ

# user_disabled
source: This user has been disabled. Please contact support for help.
vi: Người dùng này đã bị vô hiệu hóa. Vui lòng liên hệ hỗ trợ để được giúp đỡ.

# email_already_in_use
source: An account already exists for that email.
vi: Đã có tài khoản sử dụng email này.

# operation_not_allowed
source: Operation is not allowed. Please contact support.
vi: Hoạt động không được phép. Vui lòng liên hệ hỗ trợ.

# weak_password
source: Please enter a stronger password.
vi: Vui lòng nhập mật khẩu mạnh hơn.

# user_not_found
source: Email is not found, please create an account.
vi: Email không được tìm thấy, vui lòng tạo tài khoản.

# wrong_password
source: Incorrect password, please try again.
vi: Mật khẩu không chính xác, vui lòng thử lại.

# account_exists_with_different_credential
source: Account exists with different credentials.
vi: Tài khoản đã tồn tại với thông tin đăng nhập khác.

# invalid_credential
source: Invalid email or password.
vi: Email hoặc mật khẩu không hợp lệ.

# invalid_verification_code
source: The credential verification code received is invalid.
vi: Mã xác minh nhận được không hợp lệ.

# invalid_verification_id
source: The credential verification ID received is invalid.
vi: ID xác minh nhận được không hợp lệ.

# unknown_exception
source: An unknown exception occurred.
vi: Đã xảy ra lỗi không xác định.

# invalid_age
source: Please select a valid age
vi: Vui lòng chọn một độ tuổi phù hợp

# passwords_do_not_match
source: Password does not match
vi: Mật khẩu không trùng khớp

source: Today
vi: Hôm nay

source: Settings
vi: Cài đặt

source: Notifications
vi: Thông báo

source: All Habits
vi: Tất cả thói quen

# general_section
source: General
vi: Chung

# language_tile
source: Language
vi: Ngôn ngữ

# english_choice
source: English
vi: Tiếng Anh

# vietnamese_choice
source: Vietnamese
vi: Tiếng Việt

# theme_tile
source: Theme
vi: Giao diện

source: Dark Theme
vi: Chế độ tối

source: Light Theme
vi: Chế độ sáng

# measurement_unit_title
source: Measurement Unit
vi: Đơn vị đo lường

source: Metric Unit
vi: Hệ mét

source: Imperial Unit
vi: Hệ Anh

# account_section
source: Account
vi: Tài khoản

# authentication_choice
source: Sign in/Sign up
vi: Đăng nhập/Đăng ký

# manage_account_choice
source: Manage Account
vi: Quản lý tài khoản

source: Reset Password
vi: Đặt lại mật khẩu

source: Birthdate
vi: Sinh nhật

# personal_info_section
source: Personal Information
vi: Thông tin cá nhân

# age_field
source: Age
vi: Tuổi

source: Display Name
vi: Tên

# phone_number
source: Phone
vi: Điện thoại

# gender_field
source: Gender
vi: Giới tính

# password_field
source: Password
vi: Mật khẩu

# confirm_password_field
source: Confirm Password
vi: Xác nhận mật khẩu

source: Additional Information
vi: Thông tin bổ sung

# terms_and_conditions
source: Terms & Conditions
vi: Điều khoản & Điều kiện

# help_tile
source: Help
vi: Trợ giúp

# know_more_about_habit
source: More Knowledge about habit
vi: Hiểu về thói quen

# time_of_day_section
source: Time of day
vi: Thời gian trong ngày

# dawn_tile
source: Dawn
vi: Bình minh

# afternoon_tile
source: Afternoon
vi: Buổi chiều

# dusk_tile
source: Dusk
vi: Hoàng hôn

source: No Date Selected
vi: Chưa ngày nào được chọn

# habits
source: {count, plural, =0{No habits} =1{1 habit} other{{count} habits}}
vi: {count, plural, =0{0 thói quen} =1{1 thói quen} other{{count} thói quen}}

source: Habit Name
vi: Tên thói quen

# habit_desc
source: Habit Description
vi: Mô tả thói quen

source: Habit Category
vi: Loại thói quen

# habit_detail
source: Habit Details
vi: Chi tiết thói quen

# statistic_section
source: Statistics
vi: Thống kê

source: Longest Streak
vi: Chuỗi dài nhất

# trend_section
source: Trend
vi: Xu hướng

source: Today Tasks
vi: Nhiệm vụ hôm nay

# achievement_done
source: Achievement
vi: Thành tựu

# progress_section
source: Progress
vi: Quá trình

source: Current Progress
vi: Tiến độ hiện tại

# completed_progress
source: {count}% Completed
vi: Hoàn thành {count}%

# duration_title
source: Duration
vi: Thời gian thực hiện

# target_title
source: Target
vi: Mục tiêu

# on_your_way
source: You are {value}% on your way
vi: Bạn đã đi được {value}% chặng đường

source: Mark as done
vi: Đã thực hiện

source: Mark as pause
vi: Tạm dừng

# last_completed_at
source: Last completed at: {dateTime}
vi: Hoàn thành gần nhất vào lúc: {dateTime}

# daily_completed
source: You completed this habit today
vi: Bạn đã hoàn thành thói quen cho ngày hôm nay

# daily_paused
source: You delayed this habit today
vi: Bạn đã tạm dừng thói quen này hôm nay

# rate_and_note_completed_habit
source: Rate & Note
vi: Đánh giá và ghi chú

source: Pick Icon
vi: Chọn icon

source: Pick Color
vi: Chọn màu

# health_and_sport
source: Heath and Sport
vi: Sức khỏe và thể thao

source: Education and Improvement
vi: Giáo dục và phát triển

source: Mental Health
vi: Sức khỏe tinh thần

source: Daily Routine
vi: Lối sống hằng ngày

source: Productivity
vi: Năng suất

# society_and_family
source: Social and Family
vi: Xã hội và gia đình

# status_failed
source: Failed
vi: Thất bại

# status_in_progress
source: In Progress
vi: Đang thực hiện

# status_paused
source: Paused
vi: Tạm dừng

# status_skipped
source: Skipped
vi: Bỏ qua

# status_achieved
source: Achieved
vi: Đạt được

# status_pending
source: Pending
vi: Chờ xử lý

# status_unknown
source: Unknown
vi: Không xác định

# status_completed
source: Completed
vi: Hoàn thành

# habit_failure_reason_lack_of_time
source: Lack of Time
vi: Thiếu thời gian

# habit_failure_reason_lack_of_motivation
source: Lack of Motivation
vi: Thiếu động lực

# habit_failure_reason_health_issues
source: Health Issues
vi: Vấn đề sức khỏe

# habit_failure_reason_unexpected_events
source: Unexpected Events
vi: Sự kiện bất ngờ

# habit_failure_reason_forgetfulness
source: Forgetfulness
vi: Hay quên

# habit_failure_reason_too_difficult
source: Too Difficult
vi: Quá khó khăn

# habit_failure_reason_lack_of_resources
source: Lack of Resources
vi: Thiếu tài nguyên

# habit_failure_reason_procrastination
source: Procrastination
vi: Trì hoãn

# habit_failure_reason_external_distractions
source: External Distractions
vi: Phân tâm bên ngoài

# habit_failure_reason_other
source: Other
vi: Khác

# habit_failure_reason_unknown
source: Unknown
vi: Không xác định

# habit_pause_reason_lack_of_time
source: Lack of Time
vi: Thiếu thời gian

# habit_pause_reason_lack_of_motivation
source: Lack of Motivation
vi: Thiếu động lực

# habit_pause_reason_health_issues
source: Health Issues
vi: Vấn đề sức khỏe

# habit_pause_reason_unexpected_events
source: Unexpected Events
vi: Sự kiện bất ngờ

# habit_pause_reason_need_for_rest
source: Need for Rest
vi: Cần nghỉ ngơi

# habit_pause_reason_reassessment
source: Reassessment
vi: Đánh giá lại

# habit_pause_reason_other
source: Other
vi: Khác

# habit_pause_reason_unknown
source: Unknown
vi: Không xác định

# habit_category_health
source: Health
vi: Sức khỏe

# habit_category_education
source: Education
vi: Học tập

# habit_category_productivity
source: Productivity
vi: Năng suất

# habit_category_mindfulness
source: Mindfulness
vi: Chánh niệm

# habit_category_lifestyle
source: Lifestyle
vi: Phong cách sống

# habit_category_nutrition
source: Nutrition
vi: Dinh dưỡng

# habit_category_social
source: Social
vi: Xã hội

# habit_category_finance
source: Finance
vi: Tài chính

# habit_category_creativity
source: Creativity
vi: Sáng tạo

# habit_category_environmental
source: Environmental
vi: Môi trường

# habit_category_unknown
source: Unknown
vi: Không xác định

# tracker_section
source: Tracker
vi: Theo dõi

# add_water_button
source: Add {count}ML
vi: Thêm {count}ML

# remove_water_button
source: Remove {count}ssucML
vi: Giảm {count}ML

source: Start Tracking
vi: Bắt đầu theo dõi

source: Pause Tracking
vi: Tạm dừng theo dõi

source: Stop Tracking
vi: Dừng theo dõi

# stop_tracking_confirm
source: Do you want to stop or keep this tracking?
vi: Bạn muốn dừng hay tiếp tục theo dõi?

source: Current Distance
vi: Quãng đường hiện tại

source: Total Distance
vi: Tổng quãng đường

source: Time Tracker
vi: Bộ đếm theo dõi

# pause_button
source: Pause
vi: Tạm dừng

# resume_button
source: Resume
vi: Tiếp tục

# stop_button
source: Stop
vi: Dừng

# paused_at
source: Paused at {text}
vi: Dừng tại {text}

# not_allow_track
source: We don't have permission to track your distance
vi: Chúng tôi không được cấp quyền để theo dõi quãng đường di chuyển của bạn

# history_section
source: History
vi: Lịch sử thực hiện

source: All Detail History
vi: Chi tiết các lịch sử

# detail_section
source: Detail
vi: Chi tiết

# mood_title
source: Mood
vi: Tâm trạng

# date_title
source: Date
vi: Ngày

# mood_great
source: Great
vi: Tuyệt vời

# mood_good
source: Good
vi: Tốt

# mood_neutral
source: Neutral
vi: Bình thường

# mood_bad
source: Bad
vi: Tệ

# mood_terrible
source: Terrible
vi: Rất tệ

# history_empty
source: No history found
vi: Không có lịch sử nào được tìm thấy

source: Cannot get any history
vi: Không thể lấy bất cứ lịch sử nào

source: Cannot store history
vi: Không thể lưu lịch sử

# all_statistic_page
source: All
vi: Tất cả

# active_statistic_page
source: Active
vi: Đang thực hiện

# achieved_statistic_page
source: Achieved
vi: Đã đạt được

# failed_statistic_page
source: Failed
vi: Thất bại

# miss_title
source: Miss
vi: Bỏ lỡ

source: Total Habit
vi: Tất cả các thói quen

source: Active Habit
vi: Các thói quen đang thực hiện

source: Failed Habit
vi: Các thói quen đã thất bại

source: Achieved Habit
vi: Các thói quen đã đạt được

source: Paused Habit
vi: Các thói quen đang tạm dừng

source: In Progress Habit
vi: Các thói quen đang thực hiện

# same_type_habit
source: Same Habit
vi: Các thói quen cùng loại

# total_achievement
source: {count, plural, =0 {No Achievements} =1 {1 Achievement} other {{count} Achievements}}
vi: {count, plural, =0 {Chưa có thành tựu nào} =1 {1 thành tựu} other {{count} thành tựu}}

# total_streak
source: {count, plural, =0 {No Streak} =1 {1 Streak} other {{count} Streaks}}
vi: {count, plural, =0 {Chưa thực hiện chuỗi} =1 {Chuỗi 1} other {Chuối {count} ngày}}

# total_paused_time
source: Total Pause Time
vi: Tổng số thời gian tạm ngưng

source: Overall Completion Rate
vi: Tổng tỉ lệ hoàn thành

# avg_time
source: Average Time
vi: Thời gian trung bình

source: Completion Rate
vi: Tỉ lệ hoàn thành

source: Failed Rate
vi: Tỉ lệ thất bại

# category_based_completion_rate
source: Category Based Completion
vi: Tỉ lệ hoàn thành theo danh mục

source: Category Distribution
vi: Phân bố theo danh mục

# habit_status_distribution
source: Status Distribution
vi: Phân bố theo trạng thái

source: Time-Based Progress
vi: Quá trình theo thời gian

# next_habits_button
source: Next Page
vi: Trang kế tiếp

# previous_habits_button
source: Previous Page
vi: Trang trước đó

# weekly_process_section
source: Weekly
vi: Hằng tuần

# monthly_process_section
source: Monthly
vi: Hằng tháng

# last_n_day
source: {count, plural, =0 { "Today" } =1 {A day ago} other {Last {count} days}}
vi: {count, plural, =0{Hôm nay} =1{1 ngày qua} other {{count} ngày qua}}

# change_from_last_week
source: {selection, select, positive {+{percentageValue}% compared to last week} negative {-{percentageValue}% compared to last week} neutral {No change from last week} other {No change from last week}}
vi: {selection, select, positive {+{percentageValue}% so với tuần trước} negative {-{percentageValue}% so với tuần trước} neutral {Không thay đổi kể từ tuần trước} other {Không thay đổi kể từ tuần trước}}

# achieved
source: {count, plural, =0 {Achieved: 0} =1 {Achieved: 1} other {Achieved: {count}}}
vi: {count, plural, =0 {Đạt đuược: 0} =1 {Đạt được: 1} other {Đạt được: {count}}}

# failed
source: {count, plural, =0 {Failed: 0} =1 {Failed: 1} other {Failed: {count}}}
vi: {count, plural, =0 {Thất bại: 0} =1 {Thất bại: 1} other {Thất bại: {count}}}

# paused
source: {count, plural, =0 {Paused: 0} =1 {Paused: 1} other {Paused: {count}}}
vi: {count, plural, =0 {Tạm dừng: 0} =1 {Tạm dừng: 1} other {Tạm dừng: {count}}}

# in_progress
source: {count, plural, =0 {In Progress: 0} =1 {In Progress: 1} other {In Progress: {count}}}
vi: {count, plural, =0 {Đang tiến hành: 0} =1 {Đang tiến hành: 1} other {Đang tiến hành: {count}}}

# overall_progress
source: Progress: {count}/{total} {time}
vi: Tiến độ: {count}/{total} {time}

# show_all_figure_button
source: Show all figures
vi: Hiển thị các số liệu

source: Most Reason
vi: Nguyên nhân chủ yếu

source: Best Time
vi: Khoảng thời gian tốt nhất

# time_slot_heatmap
source: Daily Time Slots Map
vi: Biểu đồ thời gian trong ngày

# habit_day_performance
source: Weekly Day Performance
vi: Hiệu suất các ngày trong tuần

source: Weekly Mood
vi: Tâm trạng trong tuần

source: Most Mood
vi: Tâm trạng xuất hiện nhiều nhất

source: Mood Distribution
vi: Phân bố tâm trạng

# reminder_section
source: Reminder
vi: Nhắc nhở

source: Add reminder
vi: Thêm lịch nhắc nhở

# notification_screen_title
source: Keep your habits on track!
vi: Giữ vững thói quen của bạn!

source: Notify at:
vi: Thông báo vào lúc:

# default_greeting
source: Greetings
vi: Chào

# morning_greeting
source: Good morning
vi: Chào buổi sáng

# afternoon_greeting
source: Good Afternoon
vi: Chào buổi trưa

# evening_greeting
source: Good Evening
vi: Chào buổi chiểu

# night_greeting
source: Good night
vi: Chào buổi tối

# habit_quote_1
source: A habit cannot be tossed out the window; it must be coaxed down the stairs a step at a time
vi: Có công mài sắt, có ngày nên kim

# habit_quote_2
source: And once you understand that habits can change, you have the freedom and the responsibility to remake them
vi: Có chí thì nên

# habit_quote_3
source: Discipline is choosing between what you want now and what you want most
vi: Tích tiểu thành đại

# habit_quote_4
source: Drop by drop is the water pot filled
vi: Chớ thấy sóng cả mà ngã tay chèo

# habit_quote_5
source: Success is the sum of small efforts repeated day in and day out
vi: Mưa dầm thấm lâu, mưa lâu thấm đất

source: Compound Effect
vi: Hiệu ứng Compound

# compound_effect_description
source: Improving 1% each day will make you 37 times better after a year.
vi: Cải thiện 1% mỗi ngày sẽ giúp bạn tốt hơn 37 lần sau một năm.

source: Pareto Principle
vi: Quy luật Pareto

# pareto_principle_description
source: 20% of the right habits will bring 80% of the positive results.
vi: 20% thói quen đúng đắn sẽ mang lại 80% kết quả tích cực.

source: Power of Timing
vi: Sức mạnh của thời điểm

# power_of_timing_description
source: Performing a habit at the same time each day increases the likelihood of maintaining it by 90%.
vi: Thực hiện thói quen vào cùng một thời điểm mỗi ngày tăng 90% khả năng duy trì.

# quote_aristotle
source: We are what we repeatedly do. Excellence, then, is not an act, but a habit.
vi: Chúng ta là những gì chúng ta làm lặp đi lặp lại. Sự xuất sắc không phải là một hành động mà là một thói quen.

# quote_james_clear
source: Small habits make a big difference.
vi: Thói quen nhỏ tạo nên sự khác biệt lớn.

# quote_dwayne_johnson
source: Success is not about perfection. It's about consistency.
vi: Thành công không phải là về sự hoàn hảo. Đó là về sự nhất quán.

# science_tab
source: Science
vi: Khoa học

# psy_tab
source: Psychology
vi: Tâm lý

# statistic_info_tab
source: Statistics
vi: Thống kê

# science_21_day_rule
source: 21-Day Rule
vi: Quy tắc 21 ngày

# science_21_day_rule_description
source: Research shows it actually takes 66 days to form an automatic habit, not 21 days as commonly believed.
vi: Nghiên cứu cho thấy thực sự mất 66 ngày để hình thành một thói quen tự động, không phải 21 ngày như nhiều người vẫn nghĩ.

# science_neuroplasticity_description
source: When you repeat a behavior, the brain creates new neural connections, making the behavior more natural over time.
vi: Khi bạn lặp lại một hành vi, não tạo ra các kết nối neural mới, làm cho hành vi đó trở nên tự nhiên hơn theo thời gian.

# science_dopamine_habits
source: Dopamine and Habits
vi: Dopamine và Thói quen

# science_dopamine_habits_description
source: The brain releases dopamine not only when achieving a goal but also when recognizing cues leading to rewards.
vi: Não tiết ra dopamine không chỉ khi đạt được mục tiêu mà còn khi nhận ra tín hiệu dẫn đến phần thưởng.

# psychology_cue_routine_reward_description
source: Habits are formed by three elements: Cue, Routine, and Reward.
vi: Thói quen được hình thành từ 3 yếu tố: Tín hiệu kích hoạt, Thói quen, và Phần thưởng.

# psychology_implementation_intentions_description
source: Specifying 'when' and 'where' you will perform a habit can increase success rates by 2-3 times.
vi: Xác định cụ thể 'khi nào' và 'ở đâu' bạn sẽ thực hiện một thói quen có thể tăng tỷ lệ thành công lên 2-3 lần.

# statistics_success_rate
source: Success Rate
vi: Tỷ lệ thành công

# statistics_success_rate_description
source: 43% of our daily actions are performed unconsciously due to habits.
vi: 43% hành động hàng ngày của chúng ta được thực hiện một cách vô thức do thói quen.

# statistics_habit_formation_time
source: Habit Formation Time
vi: Thời gian hình thành

# statistics_habit_formation_time_description
source: The time to form a habit can range from 18 to 254 days depending on complexity.
vi: Thời gian hình thành thói quen có thể dao động từ 18 đến 254 ngày tùy thuộc vào độ phức tạp.

# discover_tab
source: Discover
vi: Khám phá thêm những thử thách mới

# my_custom_challenge_tab
source: My Custom Challenges
vi: Được tạo bởi tôi

# my_reward_tab
source: My Rewards
vi: Phần thưởng

# search_community_challenge
source: Search for community challenge...
vi: Tìm kiếm những thử thách từ cộng đồng...

# search_my_custom_challenge
source: Search my challenges...
vi: Tìm kiếm những thử thách của tôi...

# attendance_button
source: Start this Challenge
vi: Tham gia thử thách

# participant
source: {count, plural, =0 {No participant} =1 {1 participant} other {{count} participants}}
vi: {count, plural, =0 {Chưa có người tham gia} =1 {1 người tham gia} other {{count} người tham gia}}

# completion
source: {count, plural, =0 {No completion} =1 {1 completion} other {{count} completions}}
vi: {count, plural, =0 {Chưa có người hoàn thành} =1 {1 người hoàn thành} other {{count} người hoàn thành}}

# create_new_challenge
source: Create your own challenge
vi: Tạo những thử thách mới

# search_achievement
source: Search your achievements...
vi: Tìm kiếm thành tựu bạn đã đạt được...

# all_achievements_tab
source: All Achievements
vi: Tất cả các thành tựu đã đạt được

# collection_tab
source: Collections
vi: Bộ sưu tập

source: Personal Achievements
vi: Thành tựu cá nhân

source: Community Challenges
vi: Thử thách cộng đồng

# get_preset_habit_option
source: Get some useful pre-set habit
vi: Chọn các thói quen có sẵn

# add_habit_with_few_words_option
source: Create habit with few words
vi: Tạo thói quen mới chỉ với vài từ

# add_your_own_habit
source: Customize your own habit
vi: Tự thiết lập thói quen của bạn

# add_habit_desc
source: Habit Description (The purpose and benefits of the habit)
vi: Mô tả thói quen (Mục đích và lợi ích của thói quen đó)

source: Habit Goal
vi: Mục tiêu thói quen

# specify_title
source: Specify
vi: Cụ thể - Specify

# measurable_title
source: Measurable
vi: Đo lường - Measurable

# achievable_title
source: Achievable
vi: Đạt được - Achievable

# relevant_title
source: Relevant
vi: Thực tế - Relevant

# time_bound_title
source: Time Bound
vi: Thời gian - TimeBound

# specify_desc
source: Clear and well-defined goal that answers who, what, where, when, and why.
vi: Mục tiêu rõ ràng và cụ thể, trả lời được các câu hỏi ai, cái gì, ở đâu, khi nào và tại sao.

# measurement_desc
source: Include concrete numbers or actions that can be tracked and evaluated.
vi: Bao gồm các con số hoặc hành động cụ thể có thể được theo dõi và đánh giá.

# achievable_desc
source: Realistic and attainable within your current resources and constraints.
vi: Thực tế và có thể đạt được trong phạm vi tài nguyên và hạn chế hiện tại của bạn.

# relevant_desc
source: Aligned with your broader goals and current life situation.
vi: Phù hợp với các mục tiêu rộng hơn và tình hình cuộc sống hiện tại của bạn.

# time_bound_desc
source: Has a clear deadline or timeframe for completion.
vi: Có thời hạn hoặc khung thời gian rõ ràng để hoàn thành.

# habit_category_field_hint
source: Select a category
vi: Chọn loại thói quen

# habit_frequency
source: Frequency
vi: Tần suất

# freq_daily
source: Daily
vi: Hằng ngày

# freq_monthly
source: Monthly
vi: Hằng tháng
