Repository: truongchanbuu/1-better-a-day
Catalog: lib/l10n/intl_*.arb
Languages: vi

# freq_yearly
source: Yearly
vi: Hằng năm

# freq_value
source: Value
vi: Giá trị

source: Time Interval
vi: Các khoảng thời gian

# weekday_title
source: Weekdays
vi: Các ngày trong tuần

# every_n_month
source: {n, plural, one {Every {n} month} other {Every {n} months}}
vi: {n, plural, one {Mỗi {n} tháng} other {Mỗi {n} tháng}}

# every_n_day
source: {n, plural, one {Every {n} day} other {Every {n} days}}
vi: {n, plural, one {Mỗi {n} ngày} other {Mỗi {n} ngày}}

# every_n_minute
source: {n, plural, one {Every {n} minute} other {Every {n} minutes}}
vi: {n, plural, one {Mỗi {n} phút} other {Mỗi {n} phút}}

# every_n_hour
source: {n, plural, one {Every {n} hour} other {Every {n} hours}}
vi: {n, plural, one {Mỗi {n} giờ} other {Mỗi {n} giờ}}

# generate_habit_button
source: Generate Habit
vi: Tạo thói quen

# summary_title
source: Summary
vi: Tổng hợp

# add_habit_not_enough_info
source: Please provide at least one in habit name, description or brief goal to generate accurate SMART goal
vi: Vui lòng cung cấp ít nhất một trong các thông tin: tên thói quen, mô tả hoặc mục tiêu ngắn gọn để tạo ra mục tiêu SMART chính xác.

# invalid_num
source: Please enter number that greater than 0
vi: Vui lòng nhập một số lớn hơn 0

# invalid_start_date
source: Start date cannot be after end date
vi: Ngày bắt đầu không thể sau ngày kết thúc

# invalid_end_date
source: End date cannot be after start date
vi: Ngày kết thúc không thể trước ngày bắt đầu

# invalid_habit_prompt
source: Please provides more information to generate a better goal
vi: Vui lòng cung cấp thêm thông tin để tạo ra một thói quen chuẩn SMART hơn

source: Cannot generate habit
vi: Không thể tạo thói quen

source: Cannot update habit
vi: Không thể cập nhật thói quen

source: No habit found
vi: Không tìm thấy thói quen nào

# start_value_must_be_less_than_end
source: Start value must be less than end value
vi: Giá trị bắt đầu phải nhỏ hơn giá trị kết thúc

# end_value_must_be_greater_than_start
source: End value must be greater than start value
vi: Giá trị kết thúc phải lớn hơn giá trị bắt đầu

# smart_criteria_achieved
source: SMART Achieved
vi: Đạt được các tiêu chuẩn SMART

# specific_excellent
source: Your goal is very clear and well_defined with specific details
vi: Mục tiêu của bạn rất rõ ràng và được xác định cụ thể

# specific_good
source: Your goal has good specificity but could use more detail
vi: Mục tiêu của bạn khá cụ thể nhưng có thể cần thêm chi tiết

# specific_needs_work
source: Your goal needs more specific details about what you want to achieve
vi: Mục tiêu cần thêm chi tiết cụ thể về những gì bạn muốn đạt được

# specific_poor
source: Your goal is too vague and needs specific actions
vi: Mục tiêu quá mơ hồ và cần hành động cụ thể

# specific_suggestion_1
source: Add specific numbers or quantities to measure success
vi: Thêm số liệu hoặc số lượng cụ thể để đo lường thành công

# specific_suggestion_2
source: Include clear action verbs describing what you'll do
vi: Thêm động từ hành động rõ ràng mô tả những gì bạn sẽ làm

# specific_suggestion_3
source: Specify exactly what you want to achieve
vi: Xác định chính xác những gì bạn muốn đạt được

# measurable_excellent
source: Your goal has clear metrics and tracking methods
vi: Mục tiêu có các chỉ số và phương pháp theo dõi rõ ràng

# measurable_good
source: Your goal is measurable but could use clearer metrics
vi: Mục tiêu có thể đo lường được nhưng cần chỉ số rõ ràng hơn

# measurable_needs_work
source: Your goal needs clearer ways to measure progress
vi: Mục tiêu cần cách thức rõ ràng hơn để đo lường tiến độ

# measurable_poor
source: Your goal lacks any measurable criteria
vi: Mục tiêu thiếu tiêu chí đo lường

# measurable_suggestion_1
source: Add specific numbers to track progress
vi: Thêm số liệu cụ thể để theo dõi tiến độ

# measurable_suggestion_2
source: Include how you'll measure success
vi: Thêm cách đo lường thành công

# achievable_suggestion_1
source: Consider making the goal more achievable by avoiding absolute terms
vi: Cân nhắc làm cho mục tiêu dễ đạt hơn bằng cách tránh sử dụng các từ ngữ mang tinh tuyệt đối

# achievable_suggestion_2
source: Avoid unclear goal that cannot measure or achieve
vi: Tránh những mục tiêu không rõ ràng, không thể đo lường hoặc đạt được

# relevant_suggestion_1
source: Consider explaining why this goal is important to you
vi: Xem xét tại sao bạn cần đạt được mục đích đó

# summary_excellent
source: Excellent SMART goal! All criteria are well_defined and balanced.
vi: Mục tiêu SMART xuất sắc! Tất cả tiêu chí đều được xác định rõ ràng và cân đối.

# summary_good
source: Good SMART goal with minor areas for improvement. Score: {score}%
vi: Mục tiêu SMART tốt với một số điểm cần cải thiện nhỏ. Điểm: {score}%

# summary_needs_work
source: Goal needs work in several areas to be truly SMART. Score: {score}%
vi: Mục tiêu cần cải thiện ở một số lĩnh vực để thực sự SMART. Điểm: {score}%

# summary_poor
source: Goal needs significant improvement to meet SMART criteria. Score: {score}%
vi: Mục tiêu cần cải thiện đáng kể để đạt tiêu chí SMART. Điểm: {score}%

# action_exercise_run
source: run
vi: chạy

# action_exercise_walk
source: walk
vi: đi bộ

# action_exercise_swim
source: swim
vi: bơi

# action_exercise_workout
source: workout
vi: tập luyện

# action_exercise_jog
source: jog
vi: chạy bộ

# action_exercise_yoga
source: practice yoga
vi: tập yoga

# action_exercise_stretch
source: stretch
vi: giãn cơ

# action_exercise_gym
source: go to gym
vi: đến phòng tập

# action_learning_read
source: read
vi: đọc

# action_learning_study
source: study
vi: học

# action_learning_practice
source: practice
vi: thực hành

# action_learning_write
source: write
vi: viết

# action_learning_revise
source: revise
vi: ôn tập

# action_learning_research
source: research
vi: nghiên cứu

# action_learning_learn
source: learn
vi: học hỏi

# action_learning_master
source: master
vi: thành thạo

# action_health_meditate
source: meditate
vi: thiền

# action_health_drink
source: drink
vi: uống

# action_health_eat
source: eat
vi: ăn

# action_health_sleep
source: sleep
vi: ngủ

# action_health_breathe
source: breathe
vi: thở

# action_health_relax
source: relax
vi: thư giãn

# action_health_rest
source: rest
vi: nghỉ ngơi

# action_productivity_complete
source: complete
vi: hoàn thành

# action_productivity_finish
source: finish
vi: kết thúc

# action_productivity_achieve
source: achieve
vi: đạt được

# action_productivity_accomplish
source: accomplish
vi: thực hiện

# action_productivity_do
source: do
vi: làm

# action_productivity_work
source: work on
vi: làm việc về

# action_productivity_start
source: start
vi: bắt đầu

# action_productivity_continue
source: continue
vi: tiếp tục

# action_creative_build
source: build
vi: xây dựng

# action_creative_create
source: create
vi: tạo ra

# action_creative_develop
source: develop
vi: phát triển

# action_creative_design
source: design
vi: thiết kế

# action_creative_write
source: write
vi: viết

# action_creative_draw
source: draw
vi: vẽ

# action_creative_paint
source: paint
vi: sơn

# action_creative_compose
source: compose
vi: sáng tác

# action_social_connect
source: connect with
vi: kết nối với

# action_social_meet
source: meet
vi: gặp gỡ

# action_social_call
source: call
vi: gọi điện

# action_social_text
source: text
vi: nhắn tin

# action_social_email
source: email
vi: gửi email

# action_social_visit
source: visit
vi: thăm

# action_social_spend
source: spend time with
vi: dành thời gian với

# action_social_help
source: help
vi: giúp đỡ

# action_improvement_reduce
source: reduce
vi: giảm thiểu

# action_improvement_increase
source: increase
vi: tăng

# action_improvement_decrease
source: decrease
vi: giảm

# action_improvement_improve
source: improve
vi: cải thiện

# action_improvement_enhance
source: enhance
vi: nâng cao

# action_improvement_optimize
source: optimize
vi: tối ưu hóa

# action_improvement_upgrade
source: upgrade
vi: nâng cấp

# action_tracking_track
source: track
vi: theo dõi

# action_tracking_measure
source: measure
vi: đo lường

# action_tracking_monitor
source: monitor
vi: giám sát

# action_tracking_record
source: record
vi: ghi lại

# action_tracking_log
source: log
vi: ghi chép

# action_tracking_count
source: count
vi: đếm

# action_tracking_analyze
source: analyze
vi: phân tích

# action_time_spend
source: spend
vi: dành

# action_time_allocate
source: allocate
vi: phân bổ

# action_time_limit
source: limit
vi: giới hạn

# action_time_schedule
source: schedule
vi: lên lịch

# action_time_plan
source: plan
vi: lập kế hoạch

# action_time_organize
source: organize
vi: tổ chức

# action_time_manage
source: manage
vi: quản lý

# measurable_minute
source: min
vi: phút

# measurable_second
source: s
vi: giây

# measurable_page
source: page
vi: trang

# measurable_step
source: step
vi: bước

# measurable_rep
source: rep
vi: lần

# measurable_set
source: set
vi: hiệp

# measurable_positive_increase
source: increase
vi: tăng

# measurable_positive_improve
source: improve
vi: cải thiện

# measurable_positive_optimize
source: optimize
vi: tối ưu hóa

# measurable_positive_boost
source: boost
vi: tăng cường

# measurable_positive_growth
source: grow
vi: tăng trưởng

# measurable_positive_expand
source: expand
vi: mở rộng

# measurable_positive_enhance
source: enhance
vi: nâng cao

# measurable_positive_raise
source: raise
vi: nâng lên

# measurable_positive_develop
source: develop
vi: phát triển

# measurable_positive_build
source: build
vi: xây dựng

# measurable_positive_complete
source: complete
vi: hoàn thành

# measurable_positive_accomplish
source: accomplish
vi: hoàn tất

# measurable_positive_achieve
source: achieve
vi: đạt được

# measurable_positive_attain
source: attain
vi: đạt tới

# measurable_positive_reach
source: reach
vi: đạt được

# measurable_positive_succeed
source: succeed
vi: thành công

# measurable_positive_master
source: master
vi: làm chủ

# measurable_positive_finalize
source: finalize
vi: hoàn tất

# measurable_positive_realize
source: realize
vi: thực hiện

# measurable_positive_deliver
source: deliver
vi: hoàn thành

# measurable_positive_finish
source: finish
vi: hoàn tất

# measurable_positive_progress
source: progress
vi: tiến bộ

# measurable_positive_advance
source: advance
vi: tiến tới

# measurable_positive_strengthen
source: strengthen
vi: củng cố

# measurable_positive_cultivate
source: cultivate
vi: nuôi dưỡng

# measurable_positive_refine
source: refine
vi: tinh chỉnh

# measurable_positive_perfect
source: perfect
vi: hoàn thiện

# measurable_negative_lose
source: lose
vi: mất

# measurable_negative_decline
source: decline
vi: suy giảm

# measurable_negative_diminish
source: diminish
vi: giảm sút

# measurable_negative_decrease
source: decrease
vi: giảm

# measurable_negative_weaken
source: weaken
vi: yếu đi

# measurable_negative_fail
source: fail
vi: thất bại

# measurable_negative_revert
source: revert
vi: quay lại

# relevant_increase
source: increase
vi: tăng

# relevant_improve
source: improve
vi: cải thiện

# relevant_optimize
source: optimize
vi: tối ưu hóa

# relevant_boost
source: boost
vi: tăng cường

# relevant_enhance
source: enhance
vi: nâng cao

# relevant_expand
source: expand
vi: mở rộng

# relevant_strengthen
source: strengthen
vi: củng cố

# relevant_develop
source: develop
vi: phát triển

# relevant_raise
source: raise
vi: nâng

# relevant_accomplish
source: accomplish
vi: hoàn thành

# time_bound_deadline
source: deadline
vi: thời hạn

# time_bound_complete
source: complete
vi: hoàn thành

# time_bound_finish
source: finish
vi: kết thúc

# time_bound_finalize
source: finalize
vi: hoàn tất

# time_bound_achieve
source: achieve
vi: đạt được

# time_bound_reach
source: reach
vi: đạt đến

# time_bound_complete_by
source: complete by
vi: hoàn thành bởi

# time_bound_due
source: due
vi: đến hạn

# time_bound_end
source: end
vi: kết thúc

# time_bound_within
source: within
vi: trong vòng

# time_bound_before
source: before
vi: trước

# time_bound_on
source: on
vi: vào

# time_bound_by
source: by
vi: trước

# time_bound_duration
source: duration
vi: khoảng thời gian

# time_bound_until
source: until
vi: đến khi

# time_bound_start
source: start
vi: bắt đầu

# time_bound_start_from
source: start from
vi: bắt đầu từ

# time_bound_start_by
source: start by
vi: bắt đầu bởi

# time_bound_timeframe
source: timeframe
vi: khung thời gian

# time_bound_end_by
source: end by
vi: kết thúc bởi

# time_bound_goal
source: goal
vi: mục tiêu

# time_bound_end_date
source: end date
vi: ngày kết thúc

# time_bound_in_time
source: in time
vi: kịp thời

# time_bound_time_limit
source: time limit
vi: giới hạn thời gian

# time_bound_timely
source: timely
vi: kịp thời

# time_bound_immediate
source: immediate
vi: ngay lập tức

# time_bound_promptly
source: promptly
vi: ngay tức thì

# time_bound_soon
source: soon
vi: sớm

# time_bound_quickly
source: quickly
vi: nhanh chóng

# time_bound_urgent
source: urgent
vi: khẩn cấp

# time_bound_scheduled
source: scheduled
vi: dự kiến

# time_bound_set_date
source: set date
vi: đặt ngày

# time_bound_after
source: after
vi: sau

# time_bound_soon_after
source: soon after
vi: ngay sau khi

# time_bound_next
source: next
vi: tiếp theo

# time_bound_in_the_next
source: in the next
vi: trong vòng

# time_bound_within_the_next
source: within the next
vi: trong vòng

# time_bound_upon_completion
source: upon completion
vi: sau khi hoàn thành

# time_bound_post
source: post
vi: sau

# goal_recommend_with_no_internet_alert
source: Please note, the accuracy of your goal may be affected if there is no internet connection. Kindly check your connection and try again
vi: Xin lưu ý, độ chính xác của mục tiêu có thể bị ảnh hưởng nếu không có kết nối internet. Vui lòng kiểm tra kết nối và thử lại.

# goal_desc
source: Goal Description
vi: Mô tả mục tiêu

# add_goal_desc
source: Goal Description (Provides details about the specific goal related to that habit)
vi: Mô tả mục tiêu (Thông tin chi tiết về mục tiêu của thói quen)

source: Goal Type
vi: Loại mục tiêu

# goal_unit_value
source: Value
vi: Giá trị

source: Goal Unit
vi: Đ.vị

# reps_unit
source: reps
vi: lần

# sets_unit
source: sets
vi: bộ

# l_unit
source: liters
vi: l

# ml_unit
source: milliliters
vi: ml

# second_unit
source: second
vi: giây

# day_unit
source: day
vi: ngày

# minute_unit
source: minute
vi: phút

# hour_unit
source: hour
vi: giờ

# page_unit
source: page
vi: trang

# cm_unit
source: centimeters
vi: cm

# km_unit
source: kilometers
vi: km

# m_unit
source: meters
vi: m

# steps_unit
source: steps
vi: bước

# miles_unit
source: miles
vi: dặm

# times_unit
source: times
vi: lần

# custom_unit
source: custom
vi: tùy chỉnh

# goal_completion
source: Completion
vi: Hoàn thành

# goal_count
source: Count
vi: Đếm

# goal_distance
source: Distance
vi: Khoảng cách

# goal_duration
source: Duration
vi: Thời lượng

# goal_custom
source: Custom
vi: Tùy chỉnh

# ask_ai_button
source: Get SMART Goal Recommendation
vi: Tạo một thói quen chuẩn SMART

# ask_ai_field
source: Tell me what you want to do...
vi: Hãy cho tôi biết bạn đang muốn thực hiện gì...

# ai_habit_generate_page_title
source: Get SMART habit with few word
vi: Tạo ra thói quen chuẩn SMART với vài từ

# habit_generated_title
source: Generated SMART Habit
vi: Thói quen chuẩn SMART

# add_habit_manually
source: Create habit yourself
vi: Tự tạo thói quen

# add_success
source: Add successfully
vi: Tạo thành công

# regenerate_button
source: Generate another habit
vi: Tạo thói quen khác

# water_habit_title
source: Drink enough 2L water a day
vi: Uống đủ 2L nước mỗi ngày

# water_habit_desc
source: Stay hydrated and improve your overall health by drinking 2 liters of water every day
vi: Giữ cơ thể luôn đủ nước và cải thiện sức khỏe tổng thể bằng cách uống 2 lít nước mỗi ngày

# water_habit_goal_desc
source: Drink 2L of water daily for the next 30 days to stay hydrated and maintain good health
vi: Uống 2 lít nước mỗi ngày trong 30 ngày tới để giữ cơ thể luôn đủ nước và duy trì sức khỏe tốt

# run_habit_title
source: Walk/Run 2km
vi: Đi/Chạy bộ 2km

# run_habit_desc
source: Improve your health and energy by walking or running 2km every morning.
vi: Tăng cường sức khỏe và năng lượng bằng cách đi hoặc chạy bộ 2km mỗi sáng.

# run_habit_goal_desc
source: Walk or run 2km every morning to enhance fitness and health.
vi: Đi hoặc chạy bộ 2km mỗi sáng để cải thiện sức khỏe và thể lực.

# exercise_habit_title
source: Do exercise every morning
vi: Tập thể dục buổi sáng

# exercise_habit_desc
source: Improve health and energy by doing exercise every morning
vi: Tăng cường sức khỏe và năng lượng bằng cách tập thể dục mỗi sáng.

# exercise_habit_goal_desc
source: Do exercise 30 minutes every morning to enhance health and fitness
vi: Tập thể dục đủ 30 phút mỗi sáng để cải thiện sức khỏe và thể lực.

# meditation_habit_title
source: 5-Minute Meditation
vi: Thiền 5 phút

# meditation_habit_desc
source: Relax and reduce stress by meditating for 5 minutes each morning.
vi: Thư giãn và giảm căng thẳng bằng cách thiền 5 phút mỗi sáng.

# meditation_habit_goal_desc
source: Spend 5 minutes each morning meditating to improve focus and clarity.
vi: Dành 5 phút mỗi sáng để thiền và tăng cường sự tập trung.

# reading_habit_title
source: Read 10 Pages
vi: Đọc 10 trang sách

# reading_habit_desc
source: Enhance your knowledge and skills by reading 10 pages daily.
vi: Nâng cao kiến thức và kỹ năng bằng cách đọc 10 trang sách mỗi ngày.

# reading_habit_goal_desc
source: Read 10 pages daily to develop a habit of continuous learning.
vi: Đọc 10 trang sách mỗi ngày để phát triển thói quen học hỏi.

# study_habit_title
source: 2-Hour Focused Study
vi: Học tập tập trung 2 tiếng

# study_habit_desc
source: Improve learning efficiency by studying for 2 focused hours every evening.
vi: Nâng cao hiệu quả học tập bằng cách tập trung học trong 2 tiếng vào buổi tối.

# study_habit_goal_desc
source: Focus on studying for 2 hours every evening at 7 PM to boost knowledge.
vi: Học tập tập trung trong 2 tiếng mỗi tối vào lúc 7h tối mỗi ngày để cải thiện kiến thức.

# no_habit_item_selected
source: Please select at least one to add
vi: Vui lòng chọn ít nhất một thói quen để thêm

# cannot_get_any_habit
source: Failed to get habits
vi: Không thể lấy các thói quen

# cannot_get_habit_with_name
source: Cannot get the habit with name: {name}
vi: Không thể lấy thói quen: {name}

# all_selection
source: All
vi: Tất cả

# default_short_streak
source: Awesome! You've maintained a {count} day streak
vi: Tuyệt vời! Bạn đã duy trì chuỗi {count} ngày liên tiếp

# streak_short_0
source: Getting started! Complete your first day without missing!
vi: Bắt đầu nào! Bạn đã bắt đầu thói quen mới!

# streak_short_1
source: Great start! You've completed 1 day without missing!
vi: Khởi đầu tuyệt vời! Bạn đã đạt được 1 ngày không bỏ lỡ!

# streak_short_3
source: Keep it up! You've maintained 3 consecutive days!
vi: Cố lên! Bạn đã duy trì được 3 ngày liên tiếp rồi!

# streak_short_7
source: Excellent! You've reached 7 days in a row!
vi: Xuất sắc! Bạn đã hoàn thành 7 ngày liên tiếp!

# default_medium_streak
source: Awesome! You've maintained a {count} day streak
vi: Tuyệt vời! Bạn đã duy trì chuỗi {count} ngày liên tiếp

# streak_medium_10
source: Amazing! You've kept a 10-day streak going!
vi: Tuyệt vời! Bạn đã duy trì được 10 ngày không gián đoạn!

# streak_medium_15
source: Keep pushing! You've achieved 15 days continuously!
vi: Không ngừng nỗ lực! Bạn đã đạt được 15 ngày liên tục!

# streak_medium_30
source: You're awesome! Maintained 30 days straight!
vi: Bạn thật tuyệt! Đã duy trì 30 ngày kiên trì và đều đặn!

# default_long_streak
source: Awesome! You've maintained a {count} day streak
vi: Tuyệt vời! Bạn đã duy trì chuỗi {count} ngày liên tiếp

# streak_long_40
source: Incredible! You're on a 40-day streak!
vi: Kinh ngạc! Bạn đã duy trì thói quen liên tiếp 40 ngày!

# streak_long_60
source: Unbelievable! You've hit a 60-day streak!
vi: Thật không thể tin nổi! Bạn đã đạt được 60 ngày streak!

# streak_long_100
source: Fantastic! You've kept a 100-day streak!
vi: Tuyệt vời! Bạn đã giữ vững streak 100 ngày không gián đoạn!

# streak_very_long_150
source: Unbelievable! You've kept a 150-day streak!
vi: Không thể tin được! Bạn đã duy trì thói quen suốt 150 ngày!

# streak_very_long_200
source: Admirable! You've maintained a 200-day streak!
vi: Đáng khâm phục! Bạn đã giữ streak 200 ngày liên tiếp!

# streak_very_long_365
source: You're a hero! Achieved a 365-day streak!
vi: Bạn là người hùng! Đã đạt được 365 ngày không bỏ lỡ!

# water_reminder_title
source: Drinking Time
vi: Đến lúc uống nước

# run_reminder_title
source: Running Time
vi: Đến giờ tập chạy

# exercise_reminder_title
source: Exercise Time
vi: Đến giờ tập thể dục

# meditation_reminder_title
source: Mediation Time
vi: Đến giờ thiền

# reading_reminder_title
source: Reading Time
vi: Đến giờ đọc sách rồi

# study_reminder_title
source: Study Time
vi: Đến giờ học

# note_title
source: Note
vi: Ghi chú

# note_hint
source: Write your note here....
vi: Viết ghi chú của bạn tại đây....

# select_mood_title
source: How do you feel now?
vi: Bạn đang cảm thấy như nào?

# great_suggestion_1
source: Achieved a breakthrough!
vi: Bứt phá!

# great_suggestion_2
source: Best session ever!
vi: Tốt nhất từ trước đến nay!

# good_suggestion_1
source: Made good progress
vi: Tiến triển tốt

# good_suggestion_2
source: Feeling accomplished
vi: Cảm giác hoàn thành tốt

# neutral_suggestion_1
source: Completed as planned
vi: Hoàn thành theo kế hoạch

# neutral_suggestion_2
source: Regular session
vi: Bình thường

# bad_suggestion_1
source: Struggled a bit
vi: Có chút khó khăn

# bad_suggestion_2
source: Could be better
vi: Cần cải thiện

# terrible_suggestion_1
source: Should have make more effort
vi: Nên nỗ lực nhiều hơn

# terrible_suggestion_2
source: Need to be improved!
vi: Cần cải thiện nhiều hơn nữa!
